zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_cryp.h
/** @defgroup CRYP_Data_Width_Unit CRYP Data Width Unit
  * @{
  */

#define CRYP_DATAWIDTHUNIT_WORD   0x00000000U  /*!< By default, size unit is word */
#define CRYP_DATAWIDTHUNIT_BYTE   0x00000001U  /*!< By default, size unit is byte */

/**
  * @}
  */

/** @defgroup CRYP_Header_Width_Unit CRYP Header Width Unit
  * @{
  */

#define CRYP_HEADERWIDTHUNIT_WORD   0x00000000U  /*!< By default, size unit is word */
#define CRYP_HEADERWIDTHUNIT_BYTE   0x00000001U  /*!< By default, size unit is byte */

/**
  * @}
  */

#if !defined(USE_HAL_SAES_ONLY) || (USE_HAL_SAES_ONLY == 1)
/** @defgroup SAES_CR_CHMOD SAES CHMOD Selection
  * @{
  */

#define SAES_CR_CHMOD_AES_ECB     ((uint32_t)0x00000000)
#define SAES_CR_CHMOD_AES_CBC     (SAES_CR_CHMOD_0)
#define SAES_CR_CHMOD_AES_CTR     (SAES_CR_CHMOD_1)
#define SAES_CR_CHMOD_AES_GCM     (SAES_CR_CHMOD_0 | SAES_CR_CHMOD_1)
#define SAES_CR_CHMOD_AES_CCM     (SAES_CR_CHMOD_2)

/**
  * @}
  */
#endif /* USE_HAL_SAES_ONLY */

/** @defgroup CRYP_CR_ALGOMODE CRYP Algorithm Mode
  * @{
  */

#define CRYP_TDES_ECB             ((uint32_t)0x00000000)
#define CRYP_TDES_CBC             (CRYP_CR_ALGOMODE_0)
#define CRYP_DES_ECB              (CRYP_CR_ALGOMODE_1)
#define CRYP_DES_CBC              (CRYP_CR_ALGOMODE_0 | CRYP_CR_ALGOMODE_1)
#define CRYP_AES_ECB              (CRYP_CR_ALGOMODE_2)
#define CRYP_AES_CBC              (CRYP_CR_ALGOMODE_0 | CRYP_CR_ALGOMODE_2)
#define CRYP_AES_CTR              (CRYP_CR_ALGOMODE_1 | CRYP_CR_ALGOMODE_2)
#define CRYP_AES_KEY              (CRYP_CR_ALGOMODE_0 | CRYP_CR_ALGOMODE_1 | CRYP_CR_ALGOMODE_2)
#define CRYP_AES_GCM              (CRYP_CR_ALGOMODE_3)
#define CRYP_AES_CCM              (CRYP_CR_ALGOMODE_0 | CRYP_CR_ALGOMODE_3)

/**
  * @}
  */

/** @defgroup CRYP_Key_Size CRYP Key Size
  * @{
  */

#define CRYP_KEYSIZE_128B         0x00000000U
#define CRYP_KEYSIZE_192B         CRYP_CR_KEYSIZE_0
#define CRYP_KEYSIZE_256B         CRYP_CR_KEYSIZE_1

/**
  * @}
  */

/** @defgroup CRYP_Data_Type CRYP Data Type
  * @{
  */

#define CRYP_DATATYPE_32B         0x00000000U
#define CRYP_DATATYPE_16B         CRYP_CR_DATATYPE_0
#define CRYP_DATATYPE_8B          CRYP_CR_DATATYPE_1
#define CRYP_DATATYPE_1B          CRYP_CR_DATATYPE

#define CRYP_NO_SWAP              CRYP_DATATYPE_32B      /*!< 32-bit data type (no swapping)        */
#define CRYP_HALFWORD_SWAP        CRYP_DATATYPE_16B      /*!< 16-bit data type (half-word swapping) */
#define CRYP_BYTE_SWAP            CRYP_DATATYPE_8B       /*!< 8-bit data type (byte swapping)       */
#define CRYP_BIT_SWAP             CRYP_DATATYPE_1B       /*!< 1-bit data type (bit swapping)        */
/**
  * @}
  */

/** @defgroup CRYP_Interrupt  CRYP and SAES peripherals interrupts
  * @{
  */

#define CRYP_IT_INI       CRYP_IMSCR_INIM   /*!< CRYP peripheral input FIFO Interrupt */
#define CRYP_IT_OUTI      CRYP_IMSCR_OUTIM  /*!< CRYP peripheral output FIFO Interrupt */

#define CRYP_IT_CCFIE     SAES_IER_CCFIE    /*!< SAES peripheral computation Complete interrupt enable */
#define CRYP_IT_RWEIE     SAES_IER_RWEIE    /*!< SAES peripheral read or write Error interrupt enable  */
#define CRYP_IT_KEIE      SAES_IER_KEIE     /*!< SAES peripheral key error interrupt enable  */
#define CRYP_IT_RNGEIE    SAES_IER_RNGEIE   /*!< SAES peripheral RNG error interrupt enable  */

/**
  * @}
  */

/** @defgroup CRYP_Flags CRYP & SAES Flags
  * @{
  */

/* Flags in the SR register */
#define CRYP_FLAG_IFEM     CRYP_SR_IFEM      /*!< CRYP peripheral Input FIFO is empty */
#define CRYP_FLAG_IFNF     CRYP_SR_IFNF      /*!< CRYP peripheral Input FIFO is not Full */
#define CRYP_FLAG_OFNE     CRYP_SR_OFNE      /*!< CRYP peripheral Output FIFO is not empty */
#define CRYP_FLAG_OFFU     CRYP_SR_OFFU      /*!< CRYP peripheral Output FIFO is Full */
#define CRYP_FLAG_KERF     CRYP_SR_KERF      /*!< CRYP peripheral Key error flag */
/* Flags in the RISR register */
#define CRYP_FLAG_OUTRIS   0x01000002U  /*!< Output FIFO service raw interrupt status */
#define CRYP_FLAG_INRIS    0x01000001U  /*!< Input FIFO service raw interrupt status*/

#define CRYP_FLAG_BUSY     CRYP_SR_BUSY      /*!< The CRYP peripheral is currently processing a block of data
                                                 or a key preparation (for AES decryption). */


#define CRYP_FLAG_KEYVALID CRYP_SR_KEYVALID  /*!< CRYP or SAES peripheral Key valid flag */

#define SAES_FLAG_BUSY     SAES_SR_BUSY      /*!< The SAES peripheral is currently processing a block of data
                                                  or a key preparation (for AES decryption). */

#if defined(SAES_SR_WRERRF)
#define CRYP_FLAG_WRERR    (SAES_SR_WRERRF | 0x80000000U) /*!< SAES peripheral Write Error flag */
#else
#define CRYP_FLAG_WRERR    (SAES_SR_WRERR | 0x80000000U) /*!< SAES peripheral Write Error flag */
#endif /* SAES_SR_WRERRF */
#if defined(SAES_SR_RDERRF)
#define CRYP_FLAG_RDERR    (SAES_SR_RDERRF | 0x80000000U) /*!< SAES peripheral Read error flag */
#else
#define CRYP_FLAG_RDERR    (SAES_SR_RDERR | 0x80000000U) /*!< SAES peripheral Read error flag */
#endif /* SAES_SR_RDERRF */
#define CRYP_FLAG_CCF      SAES_ISR_CCF                   /*!< SAES peripheral Computation completed flag
                                                              as AES_ISR_CCF */
#define CRYP_FLAG_KEIF     SAES_ISR_KEIF                 /*!< SAES peripheral Key error interrupt flag */
#define CRYP_FLAG_RWEIF    SAES_ISR_RWEIF                /*!< SAES peripheral Read or Write error Interrupt flag */
#define CRYP_FLAG_RNGEIF   SAES_ISR_RNGEIF               /*!< SAES peripheral RNG error Interrupt flag */
/**
  * @}
  */

/** @defgroup CRYP_CLEAR_Flags SAES peripheral Clear Flags
  * @{
  */
#define CRYP_CLEAR_CCF      SAES_ICR_CCF    /*!< SAES peripheral clear Computation Complete Flag */
#define CRYP_CLEAR_RWEIF    SAES_ICR_RWEIF  /*!< SAES peripheral clear Error Flag : RWEIF in SAES_ISR and
                                              both RDERR and WRERR flags in SAES_SR */
#define CRYP_CLEAR_KEIF     SAES_ICR_KEIF   /*!< SAES peripheral clear Key Error Flag: KEIF in SAES_ISR */
#define CRYP_CLEAR_RNGEIF   SAES_ICR_RNGEIF /*!< SAES peripheral clear RNG error Flag  */

/**
  * @}
  */


