zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_cryp.h
/** @defgroup CRYP_Configuration_Skip CRYP Key and IV Configuration Skip Mode
  * @{
  */

#define CRYP_KEYIVCONFIG_ALWAYS        0x00000000U            /*!< Peripheral Key and IV configuration
                                                                   to do systematically */
#define CRYP_KEYIVCONFIG_ONCE          0x00000001U            /*!< Peripheral Key and IV configuration
                                                                   to do only once */
#define CRYP_KEYNOCONFIG               0x00000002U            /*!< Peripheral Key configuration to not do */

/**
  * @}
  */

/** @defgroup CRYP_Key_Mode CRYP or SAES Key Mode
  * @{
  */
#define CRYP_KEYMODE_NORMAL         0x00000000UL              /*!< Normal key usage, Key registers are freely usable */
#if defined (SAES_CR_WRAPEN)
#define CRYP_KEYMODE_WRAPPED        SAES_CR_WRAPEN            /*!< Only for SAES, Wrapped key: to encrypt or decrypt AES keys */
#define CRYP_KEYMODE_SHARED         (0x02UL << CRYP_CR_KMOD_Pos) /*!< Only for SAES, Wrapped key: to encrypt or decrypt AES keys */
#else
#define CRYP_KEYMODE_WRAPPED        SAES_CR_KMOD_0            /*!< Only for SAES, Wrapped key: to encrypt or decrypt AES keys */
#define CRYP_KEYMODE_SHARED         (0x02UL << CRYP_CR_KMOD_Pos) /*!< Key shared by SAES peripheral */
#endif /* SAES_CR_WRAPEN */
/**
  * @}
  */

/** @defgroup CRYP_Key_Select SAES Key Select
  * @{
  */

#define CRYP_KEYSEL_NORMAL       0x00000000UL           /*!< Normal key, key registers SAES_KEYx or CRYP_KEYx */
#define CRYP_KEYSEL_HW           SAES_CR_KEYSEL_0       /*!< Only for SAES, Hardware key : derived hardware
                                                             unique key (DHUK 256-bit) */
#define CRYP_KEYSEL_SW           SAES_CR_KEYSEL_1       /*!< Only for SAES, Software key : boot hardware
                                                             key BHK (256-bit) */
#define CRYP_KEYSEL_HSW          SAES_CR_KEYSEL_2       /*!< Only for SAES, DHUK XOR BHK Hardware unique
                                                             key XOR software key */
#define CRYP_KEYSEL_AHK          (SAES_CR_KEYSEL_1|SAES_CR_KEYSEL_0)  /*!< Only for SAES, Software key :
                                                                      application hardware key AHK (128- or 256-bit) */
#define CRYP_KEYSEL_DUK_AHK      (SAES_CR_KEYSEL_2|SAES_CR_KEYSEL_0)   /*!< Only for SAES, DHUK XOR AHK */
#define CRYP_KEYSEL_TEST_KEY     (SAES_CR_KEYSEL_2|SAES_CR_KEYSEL_1|SAES_CR_KEYSEL_0) /*!< Test mode key (256-bit
                                                                               hardware constant key 0xA5A5...A5A5) */
/**
  * @}
  */

#if !defined(USE_HAL_SAES_ONLY) || (USE_HAL_SAES_ONLY == 1)
/** @defgroup CRYP_Key_Protection SAES Key Protection
  * @{
  */

#define CRYP_KEYPROT_ENABLE         SAES_CR_KEYPROT     /*!< Only for SAES, Key can't be shared between
                                                             two applications with different security contexts */
#define CRYP_KEYPROT_DISABLE        0x00000000UL        /*!< Only for SAES, Key can be shared between
                                                             two applications with different security contexts */

/**
  * @}
  */

/** @defgroup CRYP_Key_Shared_Direction SAES Key Shared with Peripheral
  * @{
  */
#if defined(SAES_CR_WRAPID)
#define CRYP_KEYSHARED_SELF         0x00000000UL             /*!< Only for SAES, key is used by SAES peripheral */
#define CRYP_KEYSHARED_CRYP1        SAES_CR_WRAPID_CRYP1     /*!< Only for SAES, key is shared with CRYP1 peripheral */
#define CRYP_KEYSHARED_CRYP2        SAES_CR_WRAPID_CRYP2     /*!< Only for SAES, key is shared with CRYP2 peripheral */
#else
#define CRYP_KEYSHARED_CRYP1        0x00000000UL             /*!< Only for SAES, key is shared with CRYP1 peripheral */
#define CRYP_KEYSHARED_CRYP2        SAES_CR_KSHAREID_0       /*!< Only for SAES, key is shared with CRYP2 peripheral */
#endif /* SAES_CR_WRAPID */
/**
  * @}
  */

/** @defgroup CRYP_Mode SAES processing mode
  * @{
  */

#define CRYP_MODE_ENCRYPT                0x00000000UL            /*!< SAES peripheral encryption mode   */
#if defined (SAES_CR_WRAPEN)
#define CRYP_MODE_KEY_DERIVATION         SAES_CR_OPMOD_0         /*!< SAES peripheral key derivation    */
#define CRYP_MODE_DECRYPT                SAES_CR_OPMOD_1         /*!< SAES peripheral decryption mode   */
#else
#define CRYP_MODE_KEY_DERIVATION         SAES_CR_MODE_0          /*!< SAES peripheral key derivation    */
#define CRYP_MODE_DECRYPT                SAES_CR_MODE_1          /*!< SAES peripheral decryption mode   */
#endif /* SAES_CR_WRAPEN */

/**
  * @}
  */
#endif /* USE_HAL_SAES_ONLY */

/** @defgroup CRYP_Mode SAES processing mode
  * @{
  */

#define CRYP_OPERATINGMODE_ENCRYPT       0x00000000UL            /*!< CRYP peripheral encryption mode   */
#define CRYP_OPERATINGMODE_DECRYPT       CRYP_CR_ALGODIR         /*!< CRYP peripheral decryption mode   */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup CRYP_Exported_Macros CRYP Exported Macros
  * @{
  */

/**
  * @brief  Inform about which IP is the current INSTANCE: CRYP or SAES.
  * @param  INSTANCE: specifies the HW instance.
  * @retval None
  */
#define IS_CRYP_INSTANCE(INSTANCE) (((INSTANCE) == CRYP1) || ((INSTANCE) == CRYP2))
#define IS_SAES_INSTANCE(INSTANCE) ((INSTANCE) == SAES)

/** @brief Reset CRYP handle state
  * @param  __HANDLE__ specifies the CRYP handle.
  * @retval None
  */
#if (USE_HAL_CRYP_REGISTER_CALLBACKS == 1U)
#define __HAL_CRYP_RESET_HANDLE_STATE(__HANDLE__) do{\
                                                      (__HANDLE__)->State = HAL_CRYP_STATE_RESET;\
                                                      (__HANDLE__)->MspInitCallback = NULL;\
                                                      (__HANDLE__)->MspDeInitCallback = NULL;\
                                                     }while(0)
#else
#define __HAL_CRYP_RESET_HANDLE_STATE(__HANDLE__) ( (__HANDLE__)->State = HAL_CRYP_STATE_RESET)
#endif /* USE_HAL_CRYP_REGISTER_CALLBACKS */

/**
  * @brief  Enable/Disable the CRYP or SAES peripheral.
  * @param  __HANDLE__: specifies the CRYP handle.
  * @retval None
  */

