zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_cryp.h
#define __HAL_CRYP_ENABLE(__HANDLE__) ((IS_CRYP_INSTANCE((__HANDLE__)->Instance)) ? \
                                       (((CRYP_TypeDef *)((__HANDLE__)->Instance))->CR |=  CRYP_CR_CRYPEN) :\
                                       (((SAES_TypeDef *)((__HANDLE__)->Instance))->CR |=  SAES_CR_EN))

#define __HAL_CRYP_DISABLE(__HANDLE__) ((IS_CRYP_INSTANCE((__HANDLE__)->Instance)) ? \
                                        (((CRYP_TypeDef *)((__HANDLE__)->Instance))->CR &=  ~CRYP_CR_CRYPEN) :\
                                        (((SAES_TypeDef *)((__HANDLE__)->Instance))->CR &=  ~SAES_CR_EN))

/** @brief  Check whether the specified CRYP or SAES peripheral status flag is set or not.
  * @param  __FLAG__: specifies the flag to check.
  *         This parameter can be one of the following values:
  *            @arg CRYP_FLAG_BUSY: The CRYP core is currently processing a block of data
  *                                 or a key preparation (for AES decryption)
  *            @arg @ref CRYP_FLAG_KEYVALID Key valid flag
  *            @arg @ref CRYP_FLAG_KEIF Key error flag
  *            @arg CRYP_FLAG_IFEM: Input FIFO is empty                           (CRYP peripheral only)
  *            @arg CRYP_FLAG_IFNF: Input FIFO is not full                        (CRYP peripheral only)
  *            @arg CRYP_FLAG_INRIS: Input FIFO service raw interrupt is pending  (CRYP peripheral only)
  *            @arg CRYP_FLAG_OFNE: Output FIFO is not empty                      (CRYP peripheral only)
  *            @arg CRYP_FLAG_OFFU: Output FIFO is full                           (CRYP peripheral only)
  *            @arg CRYP_FLAG_OUTRIS: Input FIFO service raw interrupt is pending (CRYP peripheral only)
  *            @arg @ref CRYP_FLAG_WRERR Write Error flag                         (SAES peripheral only)
  *            @arg @ref CRYP_FLAG_RDERR Read Error flag                          (SAES peripheral only)
  *            @arg @ref CRYP_FLAG_CCF Computation Complete flag                  (SAES peripheral only)
  *            @arg @ref CRYP_FLAG_RWEIF Read/write Error flag                    (SAES peripheral only)
  *            @arg @ref CRYP_FLAG_RNGEIF RNG Error flag                          (SAES peripheral only)
  * @retval The state of __FLAG__ (TRUE or FALSE).
  */
#define CRYP_FLAG_MASK  0x0000001FU

#define __HAL_CRYP_GET_FLAG(__HANDLE__, __FLAG__) ((IS_CRYP_INSTANCE((__HANDLE__)->Instance)) ?\
                                                   ((__FLAG__) == CRYP_FLAG_KEYVALID )?((((((CRYP_TypeDef *) \
                                                       ((__HANDLE__)->Instance))))->SR \
                                                       & (CRYP_FLAG_KEYVALID)) == (CRYP_FLAG_KEYVALID)) : \
                                                   ((__FLAG__) == CRYP_FLAG_BUSY )?((((((CRYP_TypeDef *) \
                                                       ((__HANDLE__)->Instance))))->SR \
                                                       & (CRYP_FLAG_BUSY)) == (CRYP_FLAG_BUSY)) : \
                                                   ((__FLAG__) == CRYP_FLAG_KEIF )?((((((CRYP_TypeDef *) \
                                                       ((__HANDLE__)->Instance))))->SR \
                                                       & (CRYP_FLAG_KERF)) == (CRYP_FLAG_KERF)) : \
                                                   ((((uint8_t)((__FLAG__) >> 24)) == 0x01U)?(((((CRYP_TypeDef *) \
                                                       ((__HANDLE__)->Instance))->RISR) & ((__FLAG__) & \
                                                           CRYP_FLAG_MASK)) == ((__FLAG__) & CRYP_FLAG_MASK)): \
                                                    (((((CRYP_TypeDef *)((__HANDLE__)->Instance))->RISR) & ((__FLAG__)\
                                                        & CRYP_FLAG_MASK)) == ((__FLAG__) & CRYP_FLAG_MASK))) :\
                                                   (\
                                                    ((__FLAG__) == CRYP_FLAG_KEYVALID )?((((SAES_TypeDef *)\
                                                        (((SAES_TypeDef *)((__HANDLE__)->Instance))))->SR \
                                                        & (CRYP_FLAG_KEYVALID)) == (CRYP_FLAG_KEYVALID)) : \
                                                    ((__FLAG__) == CRYP_FLAG_BUSY )?((((SAES_TypeDef *) \
                                                        ((__HANDLE__)->Instance))->SR \
                                                        & (CRYP_FLAG_BUSY)) == (CRYP_FLAG_BUSY)) : \
                                                    ((__FLAG__) == CRYP_FLAG_WRERR )?((((SAES_TypeDef *) \
                                                        ((__HANDLE__)->Instance))->SR \
                                                        & (CRYP_FLAG_WRERR & 0x7FFFFFFFU)) == \
                                                        (CRYP_FLAG_WRERR & 0x7FFFFFFFU)) : \
                                                    ((__FLAG__) == CRYP_FLAG_RDERR )?((((SAES_TypeDef *) \
                                                        ((__HANDLE__)->Instance))->SR \
                                                        & (CRYP_FLAG_RDERR & 0x7FFFFFFFU)) == \
                                                        (CRYP_FLAG_RDERR & 0x7FFFFFFFU)) : \
                                                    ((__FLAG__) == CRYP_FLAG_RNGEIF )?((((SAES_TypeDef *) \
                                                        ((__HANDLE__)->Instance))->ISR \
                                                        & (CRYP_FLAG_RNGEIF)) == (CRYP_FLAG_RNGEIF)) : \
                                                    ((__FLAG__) == CRYP_FLAG_KEIF )?((((SAES_TypeDef *) \
                                                        ((__HANDLE__)->Instance))->ISR \
                                                        & (CRYP_FLAG_KEIF)) == (CRYP_FLAG_KEIF)) : \
                                                    ((__FLAG__) == CRYP_FLAG_RWEIF )?((((SAES_TypeDef *) \
                                                        ((__HANDLE__)->Instance))->ISR \
                                                        & (CRYP_FLAG_RWEIF)) == (CRYP_FLAG_RWEIF)) : \
                                                    ((((SAES_TypeDef *)((__HANDLE__)->Instance))->ISR & \
                                                      (CRYP_FLAG_CCF)) == (CRYP_FLAG_CCF))))

#if !defined(USE_HAL_SAES_ONLY) || (USE_HAL_SAES_ONLY == 1)
/** @brief  Clear the SAES peripheral pending status flag.
  * @param  __HANDLE__ specifies the SAES handle.
  * @param  __FLAG__ specifies the flag to clear.
  *         This parameter can be one of the following values:
  *            @arg @ref CRYP_CLEAR_RWEIF Read (RDERR), Write (WRERR) or Read/write (RWEIF) Error  Flag Clear
  *            @arg @ref CRYP_CLEAR_CCF Computation Complete Flag (CCF) Clear
  *            @arg @ref CRYP_CLEAR_KEIF Key error interrupt flag clear
  *            @arg @ref CRYP_CLEAR_RNGEIF RNG error interrupt flag clear
  * @retval None
  */
#define __HAL_CRYP_CLEAR_FLAG(__HANDLE__, __FLAG__) SET_BIT(((SAES_TypeDef *)((__HANDLE__)->Instance))->ICR, (__FLAG__))
#endif /* USE_HAL_SAES_ONLY */

