zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_cryp.h
/* Private macros --------------------------------------------------------*/
/** @defgroup CRYP_Private_Macros   CRYP Private Macros
  * @{
  */

/** @defgroup CRYP_IS_CRYP_Definitions CRYP Private macros to check input parameters
  * @{
  */

#define IS_CRYP_ALGORITHM(ALGORITHM) (((ALGORITHM)  == CRYP_DES_ECB)   || \
                                      ((ALGORITHM)  == CRYP_DES_CBC)   || \
                                      ((ALGORITHM)  == CRYP_TDES_ECB)  || \
                                      ((ALGORITHM)  == CRYP_TDES_CBC)  || \
                                      ((ALGORITHM)  == CRYP_AES_ECB)   || \
                                      ((ALGORITHM)  == CRYP_AES_CBC)   || \
                                      ((ALGORITHM)  == CRYP_AES_CTR)   || \
                                      ((ALGORITHM)  == CRYP_AES_GCM)   || \
                                      ((ALGORITHM)  == CRYP_AES_CCM))

#define IS_CRYP_KEYSIZE(KEYSIZE) (((KEYSIZE) == CRYP_KEYSIZE_128B)   || \
                                  ((KEYSIZE) == CRYP_KEYSIZE_192B)   || \
                                  ((KEYSIZE) == CRYP_KEYSIZE_256B))

#define IS_CRYP_DATATYPE(DATATYPE) (((DATATYPE) == CRYP_DATATYPE_32B) || \
                                    ((DATATYPE) == CRYP_DATATYPE_16B) || \
                                    ((DATATYPE) == CRYP_DATATYPE_8B)  || \
                                    ((DATATYPE) == CRYP_DATATYPE_1B))

#define IS_CRYP_INIT(CONFIG) (((CONFIG) == CRYP_KEYIVCONFIG_ALWAYS) || \
                              ((CONFIG) == CRYP_KEYIVCONFIG_ONCE)   || \
                              ((CONFIG) == CRYP_KEYNOCONFIG))

#define IS_CRYP_KEYIVCONFIG(CONFIG) (((KEYSIZE) == CRYP_KEYSIZE_128B) || \
                                     ((KEYSIZE) == CRYP_KEYSIZE_192B)  || \
                                     ((KEYSIZE) == CRYP_KEYSIZE_256B))

#if !defined(USE_HAL_SAES_ONLY) || (USE_HAL_SAES_ONLY == 1)
#define IS_CRYP_KEYMODE(MODE) (((MODE) == CRYP_KEYMODE_NORMAL) || \
                               ((MODE) == CRYP_KEYMODE_SHARED))

#define IS_SAES_ALGORITHM(ALGORITHM) (((ALGORITHM) == CRYP_AES_ECB)   || \
                                      ((ALGORITHM) == CRYP_AES_CBC)   || \
                                      ((ALGORITHM) == CRYP_AES_CTR)   || \
                                      ((ALGORITHM) == CRYP_AES_GCM)   || \
                                      ((ALGORITHM) == CRYP_AES_CCM))

#define IS_SAES_KEYSIZE(KEYSIZE) (((KEYSIZE) == CRYP_KEYSIZE_128B)  || \
                                  ((KEYSIZE) == CRYP_KEYSIZE_192B)  || \
                                  ((KEYSIZE) == CRYP_KEYSIZE_256B))

#define IS_SAES_DATATYPE(DATATYPE) (((DATATYPE) == SAES_DATATYPE_32B) || \
                                    ((DATATYPE) == SAES_DATATYPE_16B) || \
                                    ((DATATYPE) == SAES_DATATYPE_8B)  || \
                                    ((DATATYPE) == SAES_DATATYPE_1B))

#define IS_SAES_KEYMODE(MODE) (((MODE) == CRYP_KEYMODE_NORMAL)  || \
                               ((MODE) == CRYP_KEYMODE_WRAPPED) || \
                               ((MODE) == CRYP_KEYMODE_SHARED))

#define IS_SAES_KEYPROT(PROTECTION) (((PROTECTION) == CRYP_KEYPROT_ENABLE)  || \
                                     ((PROTECTION) == CRYP_KEYPROT_DISABLE))

#define IS_SAES_KEYSEL(SELECTION) (((SELECTION) == CRYP_KEYSEL_NORMAL)   || \
                                   ((SELECTION) == CRYP_KEYSEL_HW)       || \
                                   ((SELECTION) == CRYP_KEYSEL_SW)       || \
                                   ((SELECTION) == CRYP_KEYSEL_HSW)      || \
                                   ((SELECTION) == CRYP_KEYSEL_AHK)      || \
                                   ((SELECTION) == CRYP_KEYSEL_DUK_AHK)  || \
                                   ((SELECTION) == CRYP_KEYSEL_TEST_KEY))
#if defined(SAES_CR_WRAPID)
#define IS_SAES_KEYSHARED(PERIPHERAL) (((PERIPHERAL) == CRYP_KEYSHARED_SELF) ||\
                                       ((PERIPHERAL) == CRYP_KEYSHARED_CRYP1) ||\
                                       ((PERIPHERAL) == CRYP_KEYSHARED_CRYP2))
#else
#define IS_SAES_KEYSHARED(PERIPHERAL) (((PERIPHERAL) == SAES_CR_KSHAREID_0)  ||\
                                       ((PERIPHERAL) == SAES_CR_KSHAREID_1))
#endif /* SAES_CR_WRAPID */
/**
  * @}
  */
#endif /* USE_HAL_SAES_ONLY */

/** @defgroup SAES_CONV_Definitions SAES Private macros to convert input parameters from CRYP peripheral to
     SAES peripheral format
  * @{
  */
#if !defined(USE_HAL_SAES_ONLY) || (USE_HAL_SAES_ONLY == 1)
#define SAES_CONV_DATATYPE(__DATATYPE__) ((__DATATYPE__) >> (CRYP_CR_DATATYPE_Pos - SAES_CR_DATATYPE_Pos))

#if defined(SAES_CR_WRAPEN)
#define SAES_CONV_KEYSIZE(__KEY__) (((__KEY__)\
                                     & CRYP_CR_KEYSIZE_Msk) << (SAES_CR_KEYSIZE_Pos - CRYP_CR_KEYSIZE_Pos))
#else
#define SAES_CONV_KEYSIZE(__KEY__) (((__KEY__)\
                                     & CRYP_CR_KEYSIZE_Msk) << (SAES_CR_KEYSIZE_Pos - (CRYP_CR_KEYSIZE_Pos + 1U)))
#endif /* SAES_CR_WRAPEN */
#define SAES_CONV_ALGO(__ALGO__) (((__ALGO__)\
                                   & (CRYP_CR_ALGOMODE_1 | CRYP_CR_ALGOMODE_0)) << (SAES_CR_CHMOD_Pos - \
                                       CRYP_CR_ALGOMODE_Pos))
#endif /* USE_HAL_SAES_ONLY */
#if defined(SAES_CR_OPMOD)
#define CRYP_CONV_ALGODIR(__ALGODIR__) (((__ALGODIR__)\
                                         & CRYP_MODE_DECRYPT) >> ((SAES_CR_OPMOD_Pos + 1U) - CRYP_CR_ALGODIR_Pos))
#else
#define CRYP_CONV_ALGODIR(__ALGODIR__) (((__ALGODIR__)\
                                         & CRYP_MODE_DECRYPT) >> ((SAES_CR_MODE_Pos + 1U) - CRYP_CR_ALGODIR_Pos))
#endif /* SAES_CR_OPMOD */

/**
  * @}
  */


/**
  * @}
  */


/* Private constants ---------------------------------------------------------*/
/** @defgroup CRYP_Private_Constants CRYP Private Constants
  * @{
  */
#if !defined(USE_HAL_CRYP_ONLY) || (USE_HAL_CRYP_ONLY == 1)
#define CRYP_PHASE_INIT                  0x00000000U             /*!< GCM/GMAC (or CCM) init phase */
#define CRYP_PHASE_HEADER                CRYP_CR_GCM_CCMPH_0     /*!< GCM/GMAC or CCM header phase */
#define CRYP_PHASE_PAYLOAD               CRYP_CR_GCM_CCMPH_1     /*!< GCM(/CCM) payload phase      */
#define CRYP_PHASE_FINAL                 CRYP_CR_GCM_CCMPH       /*!< GCM/GMAC or CCM  final phase */
#endif /* USE_HAL_CRYP_ONLY */

#if !defined(USE_HAL_SAES_ONLY) || (USE_HAL_SAES_ONLY == 1)
#if defined(SAES_CR_CPHASE)
#define SAES_PHASE_INIT                  0x00000000U             /*!< GCM/GMAC (or CCM) init phase */
#define SAES_PHASE_HEADER                SAES_CR_CPHASE_0        /*!< GCM/GMAC or CCM header phase */
#define SAES_PHASE_PAYLOAD               SAES_CR_CPHASE_1        /*!< GCM(/CCM) payload phase      */
#define SAES_PHASE_FINAL                 SAES_CR_CPHASE          /*!< GCM/GMAC or CCM  final phase */
#define SAES_OPERATION_MODE              SAES_CR_OPMOD           /*!< SAES Mode Of Operation */
#else
#define SAES_PHASE_INIT                  0x00000000U             /*!< GCM/GMAC (or CCM) init phase */
#define SAES_PHASE_HEADER                SAES_CR_GCMPH_0         /*!< GCM/GMAC or CCM header phase */
#define SAES_PHASE_PAYLOAD               SAES_CR_GCMPH_1         /*!< GCM(/CCM) payload phase      */
#define SAES_PHASE_FINAL                 SAES_CR_GCMPH           /*!< GCM/GMAC or CCM  final phase */
#define SAES_OPERATION_MODE              SAES_CR_MODE            /*!< SAES Mode Of Operation */
#endif /* SAES_CR_CPHASE */
#endif /* USE_HAL_SAES_ONLY */
/**
  * @}
  */

/* Private defines -----------------------------------------------------------*/
/** @defgroup CRYP_Private_Defines CRYP Private Defines
  * @{
  */

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @defgroup CRYP_Private_Variables CRYP Private Variables
  * @{
  */

/**
  * @}
  */
/* Private functions prototypes ----------------------------------------------*/
/** @defgroup CRYP_Private_Functions_Prototypes CRYP Private Functions Prototypes
  * @{
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup CRYP_Private_Functions CRYP Private Functions
  * @{
  */

/**
  * @}
  */


/**
  * @}
  */


#endif /* (defined (CRYP1) || defined (CRYP2) || defined (SAES)) */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

/**
  * @}
  */

#endif /* STM32MP2xx_HAL_CRYP_H */
